GopalSaraf/Practicals/PSDL/include/proc/pic18lf46j13.inc
// Register: CCP3CON
#define CCP3CON CCP3CON
CCP3CON                                  equ 0F15h
// bitfield definitions
CCP3CON_CCP3M_POSN                       equ 0000h
CCP3CON_CCP3M_POSITION                   equ 0000h
CCP3CON_CCP3M_SIZE                       equ 0004h
CCP3CON_CCP3M_LENGTH                     equ 0004h
CCP3CON_CCP3M_MASK                       equ 000Fh
CCP3CON_DC3B_POSN                        equ 0004h
CCP3CON_DC3B_POSITION                    equ 0004h
CCP3CON_DC3B_SIZE                        equ 0002h
CCP3CON_DC3B_LENGTH                      equ 0002h
CCP3CON_DC3B_MASK                        equ 0030h
CCP3CON_P3M_POSN                         equ 0006h
CCP3CON_P3M_POSITION                     equ 0006h
CCP3CON_P3M_SIZE                         equ 0002h
CCP3CON_P3M_LENGTH                       equ 0002h
CCP3CON_P3M_MASK                         equ 00C0h
CCP3CON_CCP3M0_POSN                      equ 0000h
CCP3CON_CCP3M0_POSITION                  equ 0000h
CCP3CON_CCP3M0_SIZE                      equ 0001h
CCP3CON_CCP3M0_LENGTH                    equ 0001h
CCP3CON_CCP3M0_MASK                      equ 0001h
CCP3CON_CCP3M1_POSN                      equ 0001h
CCP3CON_CCP3M1_POSITION                  equ 0001h
CCP3CON_CCP3M1_SIZE                      equ 0001h
CCP3CON_CCP3M1_LENGTH                    equ 0001h
CCP3CON_CCP3M1_MASK                      equ 0002h
CCP3CON_CCP3M2_POSN                      equ 0002h
CCP3CON_CCP3M2_POSITION                  equ 0002h
CCP3CON_CCP3M2_SIZE                      equ 0001h
CCP3CON_CCP3M2_LENGTH                    equ 0001h
CCP3CON_CCP3M2_MASK                      equ 0004h
CCP3CON_CCP3M3_POSN                      equ 0003h
CCP3CON_CCP3M3_POSITION                  equ 0003h
CCP3CON_CCP3M3_SIZE                      equ 0001h
CCP3CON_CCP3M3_LENGTH                    equ 0001h
CCP3CON_CCP3M3_MASK                      equ 0008h
CCP3CON_DC3B0_POSN                       equ 0004h
CCP3CON_DC3B0_POSITION                   equ 0004h
CCP3CON_DC3B0_SIZE                       equ 0001h
CCP3CON_DC3B0_LENGTH                     equ 0001h
CCP3CON_DC3B0_MASK                       equ 0010h
CCP3CON_DC3B1_POSN                       equ 0005h
CCP3CON_DC3B1_POSITION                   equ 0005h
CCP3CON_DC3B1_SIZE                       equ 0001h
CCP3CON_DC3B1_LENGTH                     equ 0001h
CCP3CON_DC3B1_MASK                       equ 0020h
CCP3CON_P3M0_POSN                        equ 0006h
CCP3CON_P3M0_POSITION                    equ 0006h
CCP3CON_P3M0_SIZE                        equ 0001h
CCP3CON_P3M0_LENGTH                      equ 0001h
CCP3CON_P3M0_MASK                        equ 0040h
CCP3CON_P3M1_POSN                        equ 0007h
CCP3CON_P3M1_POSITION                    equ 0007h
CCP3CON_P3M1_SIZE                        equ 0001h
CCP3CON_P3M1_LENGTH                      equ 0001h
CCP3CON_P3M1_MASK                        equ 0080h

// Register: CCPR3L
#define CCPR3L CCPR3L
CCPR3L                                   equ 0F16h
// bitfield definitions
CCPR3L_CCPR3L_POSN                       equ 0000h
CCPR3L_CCPR3L_POSITION                   equ 0000h
CCPR3L_CCPR3L_SIZE                       equ 0008h
CCPR3L_CCPR3L_LENGTH                     equ 0008h
CCPR3L_CCPR3L_MASK                       equ 00FFh

// Register: CCPR3H
#define CCPR3H CCPR3H
CCPR3H                                   equ 0F17h
// bitfield definitions
CCPR3H_CCPR3H_POSN                       equ 0000h
CCPR3H_CCPR3H_POSITION                   equ 0000h
CCPR3H_CCPR3H_SIZE                       equ 0008h
CCPR3H_CCPR3H_LENGTH                     equ 0008h
CCPR3H_CCPR3H_MASK                       equ 00FFh

// Register: ECCP3DEL
#define ECCP3DEL ECCP3DEL
ECCP3DEL                                 equ 0F18h
// bitfield definitions
ECCP3DEL_P3DC_POSN                       equ 0000h
ECCP3DEL_P3DC_POSITION                   equ 0000h
ECCP3DEL_P3DC_SIZE                       equ 0007h
ECCP3DEL_P3DC_LENGTH                     equ 0007h
ECCP3DEL_P3DC_MASK                       equ 007Fh
ECCP3DEL_P3RSEN_POSN                     equ 0007h
ECCP3DEL_P3RSEN_POSITION                 equ 0007h
ECCP3DEL_P3RSEN_SIZE                     equ 0001h
ECCP3DEL_P3RSEN_LENGTH                   equ 0001h
ECCP3DEL_P3RSEN_MASK                     equ 0080h
ECCP3DEL_P3DC0_POSN                      equ 0000h
ECCP3DEL_P3DC0_POSITION                  equ 0000h
ECCP3DEL_P3DC0_SIZE                      equ 0001h
ECCP3DEL_P3DC0_LENGTH                    equ 0001h
ECCP3DEL_P3DC0_MASK                      equ 0001h
ECCP3DEL_P3DC1_POSN                      equ 0001h
ECCP3DEL_P3DC1_POSITION                  equ 0001h
ECCP3DEL_P3DC1_SIZE                      equ 0001h
ECCP3DEL_P3DC1_LENGTH                    equ 0001h
ECCP3DEL_P3DC1_MASK                      equ 0002h
ECCP3DEL_P3DC2_POSN                      equ 0002h
ECCP3DEL_P3DC2_POSITION                  equ 0002h
ECCP3DEL_P3DC2_SIZE                      equ 0001h
ECCP3DEL_P3DC2_LENGTH                    equ 0001h
ECCP3DEL_P3DC2_MASK                      equ 0004h
ECCP3DEL_P3DC3_POSN                      equ 0003h
ECCP3DEL_P3DC3_POSITION                  equ 0003h
ECCP3DEL_P3DC3_SIZE                      equ 0001h
ECCP3DEL_P3DC3_LENGTH                    equ 0001h
ECCP3DEL_P3DC3_MASK                      equ 0008h
ECCP3DEL_P3DC4_POSN                      equ 0004h
ECCP3DEL_P3DC4_POSITION                  equ 0004h
ECCP3DEL_P3DC4_SIZE                      equ 0001h
ECCP3DEL_P3DC4_LENGTH                    equ 0001h
ECCP3DEL_P3DC4_MASK                      equ 0010h
ECCP3DEL_P3DC5_POSN                      equ 0005h
ECCP3DEL_P3DC5_POSITION                  equ 0005h
ECCP3DEL_P3DC5_SIZE                      equ 0001h
ECCP3DEL_P3DC5_LENGTH                    equ 0001h
ECCP3DEL_P3DC5_MASK                      equ 0020h
ECCP3DEL_P3DC6_POSN                      equ 0006h
ECCP3DEL_P3DC6_POSITION                  equ 0006h
ECCP3DEL_P3DC6_SIZE                      equ 0001h
ECCP3DEL_P3DC6_LENGTH                    equ 0001h
ECCP3DEL_P3DC6_MASK                      equ 0040h

// Register: ECCP3AS
#define ECCP3AS ECCP3AS
ECCP3AS                                  equ 0F19h
// bitfield definitions
ECCP3AS_PSS3BD_POSN                      equ 0000h
ECCP3AS_PSS3BD_POSITION                  equ 0000h
ECCP3AS_PSS3BD_SIZE                      equ 0002h
ECCP3AS_PSS3BD_LENGTH                    equ 0002h
ECCP3AS_PSS3BD_MASK                      equ 0003h
ECCP3AS_PSS3AC_POSN                      equ 0002h
ECCP3AS_PSS3AC_POSITION                  equ 0002h
ECCP3AS_PSS3AC_SIZE                      equ 0002h
ECCP3AS_PSS3AC_LENGTH                    equ 0002h
ECCP3AS_PSS3AC_MASK                      equ 000Ch
ECCP3AS_ECCP3AS_POSN                     equ 0004h
ECCP3AS_ECCP3AS_POSITION                 equ 0004h
ECCP3AS_ECCP3AS_SIZE                     equ 0003h
ECCP3AS_ECCP3AS_LENGTH                   equ 0003h
ECCP3AS_ECCP3AS_MASK                     equ 0070h
ECCP3AS_ECCP3ASE_POSN                    equ 0007h
ECCP3AS_ECCP3ASE_POSITION                equ 0007h
ECCP3AS_ECCP3ASE_SIZE                    equ 0001h
ECCP3AS_ECCP3ASE_LENGTH                  equ 0001h
ECCP3AS_ECCP3ASE_MASK                    equ 0080h
ECCP3AS_PSS3BD0_POSN                     equ 0000h
ECCP3AS_PSS3BD0_POSITION                 equ 0000h
ECCP3AS_PSS3BD0_SIZE                     equ 0001h
ECCP3AS_PSS3BD0_LENGTH                   equ 0001h
ECCP3AS_PSS3BD0_MASK                     equ 0001h
ECCP3AS_PSS3BD1_POSN                     equ 0001h
ECCP3AS_PSS3BD1_POSITION                 equ 0001h
ECCP3AS_PSS3BD1_SIZE                     equ 0001h
ECCP3AS_PSS3BD1_LENGTH                   equ 0001h
ECCP3AS_PSS3BD1_MASK                     equ 0002h
ECCP3AS_PSS3AC0_POSN                     equ 0002h
ECCP3AS_PSS3AC0_POSITION                 equ 0002h
ECCP3AS_PSS3AC0_SIZE                     equ 0001h
ECCP3AS_PSS3AC0_LENGTH                   equ 0001h
ECCP3AS_PSS3AC0_MASK                     equ 0004h
ECCP3AS_PSS3AC1_POSN                     equ 0003h
ECCP3AS_PSS3AC1_POSITION                 equ 0003h
ECCP3AS_PSS3AC1_SIZE                     equ 0001h
ECCP3AS_PSS3AC1_LENGTH                   equ 0001h
ECCP3AS_PSS3AC1_MASK                     equ 0008h
ECCP3AS_ECCP3AS0_POSN                    equ 0004h
ECCP3AS_ECCP3AS0_POSITION                equ 0004h
ECCP3AS_ECCP3AS0_SIZE                    equ 0001h
ECCP3AS_ECCP3AS0_LENGTH                  equ 0001h
ECCP3AS_ECCP3AS0_MASK                    equ 0010h
ECCP3AS_ECCP3AS1_POSN                    equ 0005h
ECCP3AS_ECCP3AS1_POSITION                equ 0005h
ECCP3AS_ECCP3AS1_SIZE                    equ 0001h
ECCP3AS_ECCP3AS1_LENGTH                  equ 0001h
ECCP3AS_ECCP3AS1_MASK                    equ 0020h
ECCP3AS_ECCP3AS2_POSN                    equ 0006h
ECCP3AS_ECCP3AS2_POSITION                equ 0006h
ECCP3AS_ECCP3AS2_SIZE                    equ 0001h
ECCP3AS_ECCP3AS2_LENGTH                  equ 0001h
ECCP3AS_ECCP3AS2_MASK                    equ 0040h

// Register: PSTR3CON
#define PSTR3CON PSTR3CON
PSTR3CON                                 equ 0F1Ah
// bitfield definitions
PSTR3CON_STRA_POSN                       equ 0000h
PSTR3CON_STRA_POSITION                   equ 0000h
PSTR3CON_STRA_SIZE                       equ 0001h
PSTR3CON_STRA_LENGTH                     equ 0001h
PSTR3CON_STRA_MASK                       equ 0001h
PSTR3CON_STRB_POSN                       equ 0001h
PSTR3CON_STRB_POSITION                   equ 0001h
PSTR3CON_STRB_SIZE                       equ 0001h
PSTR3CON_STRB_LENGTH                     equ 0001h
PSTR3CON_STRB_MASK                       equ 0002h
PSTR3CON_STRC_POSN                       equ 0002h
PSTR3CON_STRC_POSITION                   equ 0002h
PSTR3CON_STRC_SIZE                       equ 0001h
PSTR3CON_STRC_LENGTH                     equ 0001h
PSTR3CON_STRC_MASK                       equ 0004h
PSTR3CON_STRD_POSN                       equ 0003h
PSTR3CON_STRD_POSITION                   equ 0003h
PSTR3CON_STRD_SIZE                       equ 0001h
PSTR3CON_STRD_LENGTH                     equ 0001h
PSTR3CON_STRD_MASK                       equ 0008h
PSTR3CON_STRSYNC_POSN                    equ 0004h
PSTR3CON_STRSYNC_POSITION                equ 0004h
PSTR3CON_STRSYNC_SIZE                    equ 0001h
PSTR3CON_STRSYNC_LENGTH                  equ 0001h
PSTR3CON_STRSYNC_MASK                    equ 0010h
PSTR3CON_CMPL_POSN                       equ 0006h
PSTR3CON_CMPL_POSITION                   equ 0006h
PSTR3CON_CMPL_SIZE                       equ 0002h
PSTR3CON_CMPL_LENGTH                     equ 0002h
PSTR3CON_CMPL_MASK                       equ 00C0h
PSTR3CON_CMPL0_POSN                      equ 0006h
PSTR3CON_CMPL0_POSITION                  equ 0006h
PSTR3CON_CMPL0_SIZE                      equ 0001h
PSTR3CON_CMPL0_LENGTH                    equ 0001h
PSTR3CON_CMPL0_MASK                      equ 0040h
PSTR3CON_CMPL1_POSN                      equ 0007h
PSTR3CON_CMPL1_POSITION                  equ 0007h
PSTR3CON_CMPL1_SIZE                      equ 0001h
PSTR3CON_CMPL1_LENGTH                    equ 0001h
PSTR3CON_CMPL1_MASK                      equ 0080h
PSTR3CON_STRA3_POSN                      equ 0000h
PSTR3CON_STRA3_POSITION                  equ 0000h
PSTR3CON_STRA3_SIZE                      equ 0001h
PSTR3CON_STRA3_LENGTH                    equ 0001h
PSTR3CON_STRA3_MASK                      equ 0001h
PSTR3CON_STRB3_POSN                      equ 0001h
PSTR3CON_STRB3_POSITION                  equ 0001h
PSTR3CON_STRB3_SIZE                      equ 0001h
PSTR3CON_STRB3_LENGTH                    equ 0001h
PSTR3CON_STRB3_MASK                      equ 0002h
PSTR3CON_STRC3_POSN                      equ 0002h
PSTR3CON_STRC3_POSITION                  equ 0002h
PSTR3CON_STRC3_SIZE                      equ 0001h
PSTR3CON_STRC3_LENGTH                    equ 0001h
PSTR3CON_STRC3_MASK                      equ 0004h
PSTR3CON_STRD3_POSN                      equ 0003h
PSTR3CON_STRD3_POSITION                  equ 0003h
PSTR3CON_STRD3_SIZE                      equ 0001h
PSTR3CON_STRD3_LENGTH                    equ 0001h
PSTR3CON_STRD3_MASK                      equ 0008h
PSTR3CON_STRSYNC3_POSN                   equ 0004h
PSTR3CON_STRSYNC3_POSITION               equ 0004h
PSTR3CON_STRSYNC3_SIZE                   equ 0001h
PSTR3CON_STRSYNC3_LENGTH                 equ 0001h
PSTR3CON_STRSYNC3_MASK                   equ 0010h
PSTR3CON_CMPL03_POSN                     equ 0006h
PSTR3CON_CMPL03_POSITION                 equ 0006h
PSTR3CON_CMPL03_SIZE                     equ 0001h
PSTR3CON_CMPL03_LENGTH                   equ 0001h
PSTR3CON_CMPL03_MASK                     equ 0040h
PSTR3CON_CMPL13_POSN                     equ 0007h
PSTR3CON_CMPL13_POSITION                 equ 0007h
PSTR3CON_CMPL13_SIZE                     equ 0001h
PSTR3CON_CMPL13_LENGTH                   equ 0001h
PSTR3CON_CMPL13_MASK                     equ 0080h

// Register: T8CON
#define T8CON T8CON
T8CON                                    equ 0F1Bh
// bitfield definitions
T8CON_T8CKPS_POSN                        equ 0000h
T8CON_T8CKPS_POSITION                    equ 0000h
T8CON_T8CKPS_SIZE                        equ 0002h
T8CON_T8CKPS_LENGTH                      equ 0002h
T8CON_T8CKPS_MASK                        equ 0003h
T8CON_TMR8ON_POSN                        equ 0002h
T8CON_TMR8ON_POSITION                    equ 0002h
T8CON_TMR8ON_SIZE                        equ 0001h
T8CON_TMR8ON_LENGTH                      equ 0001h
T8CON_TMR8ON_MASK                        equ 0004h
T8CON_T8OUTPS_POSN                       equ 0003h
T8CON_T8OUTPS_POSITION                   equ 0003h
T8CON_T8OUTPS_SIZE                       equ 0004h
T8CON_T8OUTPS_LENGTH                     equ 0004h
T8CON_T8OUTPS_MASK                       equ 0078h
T8CON_T8CKPS0_POSN                       equ 0000h
T8CON_T8CKPS0_POSITION                   equ 0000h
T8CON_T8CKPS0_SIZE                       equ 0001h
T8CON_T8CKPS0_LENGTH                     equ 0001h
T8CON_T8CKPS0_MASK                       equ 0001h
T8CON_T8CKPS1_POSN                       equ 0001h
T8CON_T8CKPS1_POSITION                   equ 0001h
T8CON_T8CKPS1_SIZE                       equ 0001h
T8CON_T8CKPS1_LENGTH                     equ 0001h
T8CON_T8CKPS1_MASK                       equ 0002h
T8CON_T8OUTPS0_POSN                      equ 0003h
T8CON_T8OUTPS0_POSITION                  equ 0003h
T8CON_T8OUTPS0_SIZE                      equ 0001h
T8CON_T8OUTPS0_LENGTH                    equ 0001h
T8CON_T8OUTPS0_MASK                      equ 0008h
T8CON_T8OUTPS1_POSN                      equ 0004h
T8CON_T8OUTPS1_POSITION                  equ 0004h
T8CON_T8OUTPS1_SIZE                      equ 0001h
T8CON_T8OUTPS1_LENGTH                    equ 0001h
T8CON_T8OUTPS1_MASK                      equ 0010h
T8CON_T8OUTPS2_POSN                      equ 0005h
T8CON_T8OUTPS2_POSITION                  equ 0005h
T8CON_T8OUTPS2_SIZE                      equ 0001h
T8CON_T8OUTPS2_LENGTH                    equ 0001h
T8CON_T8OUTPS2_MASK                      equ 0020h
T8CON_T8OUTPS3_POSN                      equ 0006h
T8CON_T8OUTPS3_POSITION                  equ 0006h
T8CON_T8OUTPS3_SIZE                      equ 0001h
T8CON_T8OUTPS3_LENGTH                    equ 0001h
T8CON_T8OUTPS3_MASK                      equ 0040h

// Register: PR8
#define PR8 PR8
PR8                                      equ 0F1Ch
// bitfield definitions
PR8_PR8_POSN                             equ 0000h
PR8_PR8_POSITION                         equ 0000h
PR8_PR8_SIZE                             equ 0008h
PR8_PR8_LENGTH                           equ 0008h
PR8_PR8_MASK                             equ 00FFh

// Register: TMR8
#define TMR8 TMR8
TMR8                                     equ 0F1Dh
// bitfield definitions
TMR8_TMR8_POSN                           equ 0000h
TMR8_TMR8_POSITION                       equ 0000h
TMR8_TMR8_SIZE                           equ 0008h
TMR8_TMR8_LENGTH                         equ 0008h
TMR8_TMR8_MASK                           equ 00FFh

// Register: T6CON
#define T6CON T6CON
T6CON                                    equ 0F1Eh
// bitfield definitions
T6CON_T6CKPS_POSN                        equ 0000h
T6CON_T6CKPS_POSITION                    equ 0000h
T6CON_T6CKPS_SIZE                        equ 0002h
T6CON_T6CKPS_LENGTH                      equ 0002h
T6CON_T6CKPS_MASK                        equ 0003h
T6CON_TMR6ON_POSN                        equ 0002h
T6CON_TMR6ON_POSITION                    equ 0002h
T6CON_TMR6ON_SIZE                        equ 0001h
T6CON_TMR6ON_LENGTH                      equ 0001h
T6CON_TMR6ON_MASK                        equ 0004h
T6CON_T6OUTPS_POSN                       equ 0003h
T6CON_T6OUTPS_POSITION                   equ 0003h
T6CON_T6OUTPS_SIZE                       equ 0004h
T6CON_T6OUTPS_LENGTH                     equ 0004h
T6CON_T6OUTPS_MASK                       equ 0078h
T6CON_T6CKPS0_POSN                       equ 0000h
T6CON_T6CKPS0_POSITION                   equ 0000h
T6CON_T6CKPS0_SIZE                       equ 0001h
T6CON_T6CKPS0_LENGTH                     equ 0001h
T6CON_T6CKPS0_MASK                       equ 0001h
T6CON_T6CKPS1_POSN                       equ 0001h
T6CON_T6CKPS1_POSITION                   equ 0001h
T6CON_T6CKPS1_SIZE                       equ 0001h
T6CON_T6CKPS1_LENGTH                     equ 0001h
T6CON_T6CKPS1_MASK                       equ 0002h
T6CON_T6OUTPS0_POSN                      equ 0003h
T6CON_T6OUTPS0_POSITION                  equ 0003h
T6CON_T6OUTPS0_SIZE                      equ 0001h
T6CON_T6OUTPS0_LENGTH                    equ 0001h
T6CON_T6OUTPS0_MASK                      equ 0008h
T6CON_T6OUTPS1_POSN                      equ 0004h
T6CON_T6OUTPS1_POSITION                  equ 0004h
T6CON_T6OUTPS1_SIZE                      equ 0001h
T6CON_T6OUTPS1_LENGTH                    equ 0001h
T6CON_T6OUTPS1_MASK                      equ 0010h
T6CON_T6OUTPS2_POSN                      equ 0005h
T6CON_T6OUTPS2_POSITION                  equ 0005h
T6CON_T6OUTPS2_SIZE                      equ 0001h
T6CON_T6OUTPS2_LENGTH                    equ 0001h
T6CON_T6OUTPS2_MASK                      equ 0020h
T6CON_T6OUTPS3_POSN                      equ 0006h
T6CON_T6OUTPS3_POSITION                  equ 0006h
T6CON_T6OUTPS3_SIZE                      equ 0001h
T6CON_T6OUTPS3_LENGTH                    equ 0001h
T6CON_T6OUTPS3_MASK                      equ 0040h

// Register: PR6
#define PR6 PR6
PR6                                      equ 0F1Fh
// bitfield definitions
PR6_PR6_POSN                             equ 0000h
PR6_PR6_POSITION                         equ 0000h
PR6_PR6_SIZE                             equ 0008h
PR6_PR6_LENGTH                           equ 0008h
PR6_PR6_MASK                             equ 00FFh

// Register: TMR6
#define TMR6 TMR6
TMR6                                     equ 0F20h
// bitfield definitions
TMR6_TMR6_POSN                           equ 0000h
TMR6_TMR6_POSITION                       equ 0000h
TMR6_TMR6_SIZE                           equ 0008h
TMR6_TMR6_LENGTH                         equ 0008h
TMR6_TMR6_MASK                           equ 00FFh

// Register: T5GCON
#define T5GCON T5GCON
T5GCON                                   equ 0F21h
// bitfield definitions
T5GCON_T5GGO_NOT_T5DONE_POSN             equ 0003h
T5GCON_T5GGO_NOT_T5DONE_POSITION         equ 0003h
T5GCON_T5GGO_NOT_T5DONE_SIZE             equ 0001h
T5GCON_T5GGO_NOT_T5DONE_LENGTH           equ 0001h
T5GCON_T5GGO_NOT_T5DONE_MASK             equ 0008h
T5GCON_T5GSS_POSN                        equ 0000h
T5GCON_T5GSS_POSITION                    equ 0000h
T5GCON_T5GSS_SIZE                        equ 0002h
T5GCON_T5GSS_LENGTH                      equ 0002h
T5GCON_T5GSS_MASK                        equ 0003h
T5GCON_T5GVAL_POSN                       equ 0002h
T5GCON_T5GVAL_POSITION                   equ 0002h
T5GCON_T5GVAL_SIZE                       equ 0001h
T5GCON_T5GVAL_LENGTH                     equ 0001h
T5GCON_T5GVAL_MASK                       equ 0004h
T5GCON_T5GGO_nT5DONE_POSN                equ 0003h
T5GCON_T5GGO_nT5DONE_POSITION            equ 0003h
T5GCON_T5GGO_nT5DONE_SIZE                equ 0001h
T5GCON_T5GGO_nT5DONE_LENGTH              equ 0001h
T5GCON_T5GGO_nT5DONE_MASK                equ 0008h
T5GCON_T5GSPM_POSN                       equ 0004h
T5GCON_T5GSPM_POSITION                   equ 0004h
T5GCON_T5GSPM_SIZE                       equ 0001h
T5GCON_T5GSPM_LENGTH                     equ 0001h
T5GCON_T5GSPM_MASK                       equ 0010h
T5GCON_T5GTM_POSN                        equ 0005h
T5GCON_T5GTM_POSITION                    equ 0005h
T5GCON_T5GTM_SIZE                        equ 0001h
T5GCON_T5GTM_LENGTH                      equ 0001h
T5GCON_T5GTM_MASK                        equ 0020h
T5GCON_T5GPOL_POSN                       equ 0006h
T5GCON_T5GPOL_POSITION                   equ 0006h
T5GCON_T5GPOL_SIZE                       equ 0001h
T5GCON_T5GPOL_LENGTH                     equ 0001h
T5GCON_T5GPOL_MASK                       equ 0040h
T5GCON_TMR5GE_POSN                       equ 0007h
T5GCON_TMR5GE_POSITION                   equ 0007h
T5GCON_TMR5GE_SIZE                       equ 0001h
T5GCON_TMR5GE_LENGTH                     equ 0001h
T5GCON_TMR5GE_MASK                       equ 0080h
T5GCON_T5GSS0_POSN                       equ 0000h
T5GCON_T5GSS0_POSITION                   equ 0000h
T5GCON_T5GSS0_SIZE                       equ 0001h
T5GCON_T5GSS0_LENGTH                     equ 0001h
T5GCON_T5GSS0_MASK                       equ 0001h
T5GCON_T5GSS1_POSN                       equ 0001h
T5GCON_T5GSS1_POSITION                   equ 0001h
T5GCON_T5GSS1_SIZE                       equ 0001h
T5GCON_T5GSS1_LENGTH                     equ 0001h
T5GCON_T5GSS1_MASK                       equ 0002h
T5GCON_T5GGO_POSN                        equ 0003h
T5GCON_T5GGO_POSITION                    equ 0003h
T5GCON_T5GGO_SIZE                        equ 0001h
T5GCON_T5GGO_LENGTH                      equ 0001h
T5GCON_T5GGO_MASK                        equ 0008h
T5GCON_NOT_T5DONE_POSN                   equ 0003h
T5GCON_NOT_T5DONE_POSITION               equ 0003h
T5GCON_NOT_T5DONE_SIZE                   equ 0001h
T5GCON_NOT_T5DONE_LENGTH                 equ 0001h
T5GCON_NOT_T5DONE_MASK                   equ 0008h
T5GCON_nT5DONE_POSN                      equ 0003h
T5GCON_nT5DONE_POSITION                  equ 0003h
T5GCON_nT5DONE_SIZE                      equ 0001h
T5GCON_nT5DONE_LENGTH                    equ 0001h
T5GCON_nT5DONE_MASK                      equ 0008h
T5GCON_T5DONE_POSN                       equ 0003h
T5GCON_T5DONE_POSITION                   equ 0003h
T5GCON_T5DONE_SIZE                       equ 0001h
T5GCON_T5DONE_LENGTH                     equ 0001h
T5GCON_T5DONE_MASK                       equ 0008h

