GopalSaraf/Practicals/PSDL/include/proc/pic18lf46j13.inc
// Register: CVRCON
#define CVRCON CVRCON
CVRCON                                   equ 0F53h
// bitfield definitions
CVRCON_CVR_POSN                          equ 0000h
CVRCON_CVR_POSITION                      equ 0000h
CVRCON_CVR_SIZE                          equ 0004h
CVRCON_CVR_LENGTH                        equ 0004h
CVRCON_CVR_MASK                          equ 000Fh
CVRCON_CVRSS_POSN                        equ 0004h
CVRCON_CVRSS_POSITION                    equ 0004h
CVRCON_CVRSS_SIZE                        equ 0001h
CVRCON_CVRSS_LENGTH                      equ 0001h
CVRCON_CVRSS_MASK                        equ 0010h
CVRCON_CVRR_POSN                         equ 0005h
CVRCON_CVRR_POSITION                     equ 0005h
CVRCON_CVRR_SIZE                         equ 0001h
CVRCON_CVRR_LENGTH                       equ 0001h
CVRCON_CVRR_MASK                         equ 0020h
CVRCON_CVROE_POSN                        equ 0006h
CVRCON_CVROE_POSITION                    equ 0006h
CVRCON_CVROE_SIZE                        equ 0001h
CVRCON_CVROE_LENGTH                      equ 0001h
CVRCON_CVROE_MASK                        equ 0040h
CVRCON_CVREN_POSN                        equ 0007h
CVRCON_CVREN_POSITION                    equ 0007h
CVRCON_CVREN_SIZE                        equ 0001h
CVRCON_CVREN_LENGTH                      equ 0001h
CVRCON_CVREN_MASK                        equ 0080h
CVRCON_CVR0_POSN                         equ 0000h
CVRCON_CVR0_POSITION                     equ 0000h
CVRCON_CVR0_SIZE                         equ 0001h
CVRCON_CVR0_LENGTH                       equ 0001h
CVRCON_CVR0_MASK                         equ 0001h
CVRCON_CVR1_POSN                         equ 0001h
CVRCON_CVR1_POSITION                     equ 0001h
CVRCON_CVR1_SIZE                         equ 0001h
CVRCON_CVR1_LENGTH                       equ 0001h
CVRCON_CVR1_MASK                         equ 0002h
CVRCON_CVR2_POSN                         equ 0002h
CVRCON_CVR2_POSITION                     equ 0002h
CVRCON_CVR2_SIZE                         equ 0001h
CVRCON_CVR2_LENGTH                       equ 0001h
CVRCON_CVR2_MASK                         equ 0004h
CVRCON_CVR3_POSN                         equ 0003h
CVRCON_CVR3_POSITION                     equ 0003h
CVRCON_CVR3_SIZE                         equ 0001h
CVRCON_CVR3_LENGTH                       equ 0001h
CVRCON_CVR3_MASK                         equ 0008h
CVRCON_CVROEN_POSN                       equ 0006h
CVRCON_CVROEN_POSITION                   equ 0006h
CVRCON_CVROEN_SIZE                       equ 0001h
CVRCON_CVROEN_LENGTH                     equ 0001h
CVRCON_CVROEN_MASK                       equ 0040h

// Register: PMSTATL
#define PMSTATL PMSTATL
PMSTATL                                  equ 0F54h
// bitfield definitions
PMSTATL_OB0E_POSN                        equ 0000h
PMSTATL_OB0E_POSITION                    equ 0000h
PMSTATL_OB0E_SIZE                        equ 0001h
PMSTATL_OB0E_LENGTH                      equ 0001h
PMSTATL_OB0E_MASK                        equ 0001h
PMSTATL_OB1E_POSN                        equ 0001h
PMSTATL_OB1E_POSITION                    equ 0001h
PMSTATL_OB1E_SIZE                        equ 0001h
PMSTATL_OB1E_LENGTH                      equ 0001h
PMSTATL_OB1E_MASK                        equ 0002h
PMSTATL_OB2E_POSN                        equ 0002h
PMSTATL_OB2E_POSITION                    equ 0002h
PMSTATL_OB2E_SIZE                        equ 0001h
PMSTATL_OB2E_LENGTH                      equ 0001h
PMSTATL_OB2E_MASK                        equ 0004h
PMSTATL_OB3E_POSN                        equ 0003h
PMSTATL_OB3E_POSITION                    equ 0003h
PMSTATL_OB3E_SIZE                        equ 0001h
PMSTATL_OB3E_LENGTH                      equ 0001h
PMSTATL_OB3E_MASK                        equ 0008h
PMSTATL_OBUF_POSN                        equ 0006h
PMSTATL_OBUF_POSITION                    equ 0006h
PMSTATL_OBUF_SIZE                        equ 0001h
PMSTATL_OBUF_LENGTH                      equ 0001h
PMSTATL_OBUF_MASK                        equ 0040h
PMSTATL_OBE_POSN                         equ 0007h
PMSTATL_OBE_POSITION                     equ 0007h
PMSTATL_OBE_SIZE                         equ 0001h
PMSTATL_OBE_LENGTH                       equ 0001h
PMSTATL_OBE_MASK                         equ 0080h

// Register: PMSTATH
#define PMSTATH PMSTATH
PMSTATH                                  equ 0F55h
// bitfield definitions
PMSTATH_IB0F_POSN                        equ 0000h
PMSTATH_IB0F_POSITION                    equ 0000h
PMSTATH_IB0F_SIZE                        equ 0001h
PMSTATH_IB0F_LENGTH                      equ 0001h
PMSTATH_IB0F_MASK                        equ 0001h
PMSTATH_IB1F_POSN                        equ 0001h
PMSTATH_IB1F_POSITION                    equ 0001h
PMSTATH_IB1F_SIZE                        equ 0001h
PMSTATH_IB1F_LENGTH                      equ 0001h
PMSTATH_IB1F_MASK                        equ 0002h
PMSTATH_IB2F_POSN                        equ 0002h
PMSTATH_IB2F_POSITION                    equ 0002h
PMSTATH_IB2F_SIZE                        equ 0001h
PMSTATH_IB2F_LENGTH                      equ 0001h
PMSTATH_IB2F_MASK                        equ 0004h
PMSTATH_IB3F_POSN                        equ 0003h
PMSTATH_IB3F_POSITION                    equ 0003h
PMSTATH_IB3F_SIZE                        equ 0001h
PMSTATH_IB3F_LENGTH                      equ 0001h
PMSTATH_IB3F_MASK                        equ 0008h
PMSTATH_IBOV_POSN                        equ 0006h
PMSTATH_IBOV_POSITION                    equ 0006h
PMSTATH_IBOV_SIZE                        equ 0001h
PMSTATH_IBOV_LENGTH                      equ 0001h
PMSTATH_IBOV_MASK                        equ 0040h
PMSTATH_IBF_POSN                         equ 0007h
PMSTATH_IBF_POSITION                     equ 0007h
PMSTATH_IBF_SIZE                         equ 0001h
PMSTATH_IBF_LENGTH                       equ 0001h
PMSTATH_IBF_MASK                         equ 0080h

// Register: PMEL
#define PMEL PMEL
PMEL                                     equ 0F56h
// bitfield definitions
PMEL_PTENL_POSN                          equ 0000h
PMEL_PTENL_POSITION                      equ 0000h
PMEL_PTENL_SIZE                          equ 0008h
PMEL_PTENL_LENGTH                        equ 0008h
PMEL_PTENL_MASK                          equ 00FFh
PMEL_PTEN0_POSN                          equ 0000h
PMEL_PTEN0_POSITION                      equ 0000h
PMEL_PTEN0_SIZE                          equ 0001h
PMEL_PTEN0_LENGTH                        equ 0001h
PMEL_PTEN0_MASK                          equ 0001h
PMEL_PTEN1_POSN                          equ 0001h
PMEL_PTEN1_POSITION                      equ 0001h
PMEL_PTEN1_SIZE                          equ 0001h
PMEL_PTEN1_LENGTH                        equ 0001h
PMEL_PTEN1_MASK                          equ 0002h
PMEL_PTEN2_POSN                          equ 0002h
PMEL_PTEN2_POSITION                      equ 0002h
PMEL_PTEN2_SIZE                          equ 0001h
PMEL_PTEN2_LENGTH                        equ 0001h
PMEL_PTEN2_MASK                          equ 0004h
PMEL_PTEN3_POSN                          equ 0003h
PMEL_PTEN3_POSITION                      equ 0003h
PMEL_PTEN3_SIZE                          equ 0001h
PMEL_PTEN3_LENGTH                        equ 0001h
PMEL_PTEN3_MASK                          equ 0008h
PMEL_PTEN4_POSN                          equ 0004h
PMEL_PTEN4_POSITION                      equ 0004h
PMEL_PTEN4_SIZE                          equ 0001h
PMEL_PTEN4_LENGTH                        equ 0001h
PMEL_PTEN4_MASK                          equ 0010h
PMEL_PTEN5_POSN                          equ 0005h
PMEL_PTEN5_POSITION                      equ 0005h
PMEL_PTEN5_SIZE                          equ 0001h
PMEL_PTEN5_LENGTH                        equ 0001h
PMEL_PTEN5_MASK                          equ 0020h
PMEL_PTEN6_POSN                          equ 0006h
PMEL_PTEN6_POSITION                      equ 0006h
PMEL_PTEN6_SIZE                          equ 0001h
PMEL_PTEN6_LENGTH                        equ 0001h
PMEL_PTEN6_MASK                          equ 0040h
PMEL_PTEN7_POSN                          equ 0007h
PMEL_PTEN7_POSITION                      equ 0007h
PMEL_PTEN7_SIZE                          equ 0001h
PMEL_PTEN7_LENGTH                        equ 0001h
PMEL_PTEN7_MASK                          equ 0080h

// Register: PMEH
#define PMEH PMEH
PMEH                                     equ 0F57h
// bitfield definitions
PMEH_PTENH_POSN                          equ 0000h
PMEH_PTENH_POSITION                      equ 0000h
PMEH_PTENH_SIZE                          equ 0008h
PMEH_PTENH_LENGTH                        equ 0008h
PMEH_PTENH_MASK                          equ 00FFh
PMEH_PTEN8_POSN                          equ 0000h
PMEH_PTEN8_POSITION                      equ 0000h
PMEH_PTEN8_SIZE                          equ 0001h
PMEH_PTEN8_LENGTH                        equ 0001h
PMEH_PTEN8_MASK                          equ 0001h
PMEH_PTEN9_POSN                          equ 0001h
PMEH_PTEN9_POSITION                      equ 0001h
PMEH_PTEN9_SIZE                          equ 0001h
PMEH_PTEN9_LENGTH                        equ 0001h
PMEH_PTEN9_MASK                          equ 0002h
PMEH_PTEN10_POSN                         equ 0002h
PMEH_PTEN10_POSITION                     equ 0002h
PMEH_PTEN10_SIZE                         equ 0001h
PMEH_PTEN10_LENGTH                       equ 0001h
PMEH_PTEN10_MASK                         equ 0004h
PMEH_PTEN11_POSN                         equ 0003h
PMEH_PTEN11_POSITION                     equ 0003h
PMEH_PTEN11_SIZE                         equ 0001h
PMEH_PTEN11_LENGTH                       equ 0001h
PMEH_PTEN11_MASK                         equ 0008h
PMEH_PTEN12_POSN                         equ 0004h
PMEH_PTEN12_POSITION                     equ 0004h
PMEH_PTEN12_SIZE                         equ 0001h
PMEH_PTEN12_LENGTH                       equ 0001h
PMEH_PTEN12_MASK                         equ 0010h
PMEH_PTEN13_POSN                         equ 0005h
PMEH_PTEN13_POSITION                     equ 0005h
PMEH_PTEN13_SIZE                         equ 0001h
PMEH_PTEN13_LENGTH                       equ 0001h
PMEH_PTEN13_MASK                         equ 0020h
PMEH_PTEN14_POSN                         equ 0006h
PMEH_PTEN14_POSITION                     equ 0006h
PMEH_PTEN14_SIZE                         equ 0001h
PMEH_PTEN14_LENGTH                       equ 0001h
PMEH_PTEN14_MASK                         equ 0040h
PMEH_PTEN15_POSN                         equ 0007h
PMEH_PTEN15_POSITION                     equ 0007h
PMEH_PTEN15_SIZE                         equ 0001h
PMEH_PTEN15_LENGTH                       equ 0001h
PMEH_PTEN15_MASK                         equ 0080h

// Register: PMDIN2L
#define PMDIN2L PMDIN2L
PMDIN2L                                  equ 0F58h
// bitfield definitions
PMDIN2L_DATAL_POSN                       equ 0000h
PMDIN2L_DATAL_POSITION                   equ 0000h
PMDIN2L_DATAL_SIZE                       equ 0008h
PMDIN2L_DATAL_LENGTH                     equ 0008h
PMDIN2L_DATAL_MASK                       equ 00FFh

